Repository: NikitaKums/TalTech
Catalog: icd0015-2018s/HomeworkASPandDistributed/Resources/Identity/AccountManage.*.resx
Languages: et

source: Access Denied
et: Ligipääs keelatud

source: Account
et: Kasutaja

# AccountLockedOut
source: This account has been locked out, please try again later.
et: See kasutaja on lukustatud, palun proovi hiljem.

# AddAnotherLoginService
source: Add another service to log in.
et: Lisa uus sisselogimise teenus.

source: and
et: ja

# Associate
source: Associate your
et: Seo enda

# AuthApp
source: Authentication App
et: Autentimise rakendus

# AuthenticatorUri
source: Authentication Uri
et: Autentimise Uri

# AuthKeyProcess
source: This process disables 2FA until you verify your authenticator app. If you do not complete your authenticator app configuration you may lose access to your account.
et: See tegevus blokeerib 2FA kuni te ei verifitseeri enda rakendust. Kui te ei tee rakenduse seadistamist lõpuni võite kaotada enda kasutaja.

source: Change password
et: Muuda parool

source: Change your account settings
et: Kasutaja seadete muutmine

# CheckEmailResetPassword
source: Please check your email to reset your password.
et: Palun vaata enda emaili, et lähtestada enda parool.

# Code
source: Verification Code
et: Verifitseerimise kood

# ConfigureAuthApp
source: Configure authenticator app
et: Autentimise rakenduse seadistamine

source: Confirm email
et: Emaili kinnitamine

source: Confirm password
et: Parooli kinnitus

# DeleteAndCloseAccount
source: Delete data and close my account
et: Kustuta minu andmed ning lukusta minu kasutaja

source: Delete personal data
et: Kustuta isiklikud andmed

# DeletingThisData
source: Deleting this data will permanently remove your account, and this cannot be recovered.
et: Nende andmete kustutamine kustutab sinu kasutaja permanentselt ning seda ei ole võimalik taastata.

source: Disable 2FA
et: Blokeeri 2FA

# Disable2FAText
source: Disabling 2FA does not change the keys used in authenticator apps. If you wish to change the key used in an authenticator app you should reset your authenticator keys.
et: 2FA blokeerimine ei muuda võtmeid, mis on kasutusel autentimise rakendustes. Kui soovite muuta võtmed, mis on kasutusel autentimise rakenduse poolt siis peaksite lähtestama autentimise võtmed.

# DisableTwoFactorAuthentication
source: Disable two-factor authentication (2FA)
et: Blokeeri kahe faktoriline autentimine (2FA)

# Download2faApp
source: Download a two-factor authenticator app like Microsoft Authenticator for
et: Laadi alla kahe faktorilise autentimise rakendus nagu

# DownloadPersonalData
source: Download Your Personal Data
et: Laadi Alla Enda Personaalsed Andmed

# EmailToFinishLogIn
source: Please enter an email address for this site below and click the Register button to finish logging in.
et: Palun sisesta email aadress selle lehekülje jaoks ja vajuta Register nupu peale, et lõpetada sisselogimine.

# EnterEmail
source: Enter your email
et: Sisesta enda email

# ErrorMessagePasswordLength
source: The {0} must be at least {2} and at max {1} characters long.
et: {0} peab olema vähemalt {2} ja kõik rohkem {1} tähti pikk.

# ErrorMessagePasswordNoMatch
source: The new password and confirmation password do not match.
et: Uus parool ja kinnituse parool ei lange omavahel kokku.

source: External logins
et: Väline sisselogimine

# FinishingQRCode
source: Once you have scanned the QR code or input the key above, your two factor authentication app will provide you with a unique code. Enter the code in the confirmation box below.
et: Kui sul on kood olemas, skaneeri see või sisesta võti, mis on kirjas üleval, mille järel 2FA rakendus pakub sulle unikaalse koodi. Sisesta see kood kinnituse aknas allpool.

source: Forget this browser.
et: Unusta see brauser.

source: Forgot your password?
et: Unustasid enda parooli?

# Generate2FACodes
source: Generate two-factor authentication (2FA) recovery codes
et: Genereeri 2FA taastamise koodid

source: Generate recovery codes
et: Genereeri taastamise võtmed

# GeneratingNewCodes
source: Generating new recovery codes does not change the keys used in authenticator apps. If you wish to change the key used in an authenticator app you should reset your authenticator keys
et: Uute koodide genereerimine ei muude juba kasutusel olevaid võtmeid rakenduse poolt. Kui soovid muuta võtit, mis on rakenduse poolt kasutusel peaksid lähtestama autentimise võtmed.

source: here
et: siin

# HideYourCodes
source: Put these codes in a safe place!
et: Pane koodid turvalisse kohta!

# IfResetAuthKey
source: If you reset your authenticator key your authenticator app will not work until you reconfigure it.
et: Kui te lähtestate autentimise võtit siis ei ole võimalik autentimise rakendust kasutades sisse logida kuni võtit pole uuesti seadistatud.

source: Input
et: Sisend

# LessThanThreeRecoveryCodesLeft
source: You have <3 recovery codes left.
et: Sul on <3 taastamise võti alles.

source: Locked out
et: Lukustatud

# LoginProtectedWith2FA
source: Your login is protected with an authenticator app. Enter your authenticator code below.
et: Sisselogimine on kaitstud autentimise rakendusega. Palun siseda autentimise kood allpool.

# LoginUsingService
source: Login using your {0} account
et: Logi sisse kasutades {0} kasutajat

# LogoutMessage
source: Your have successfully logged out!
et: Oled edukalt välja loginud!

# LoseDeviceWithCode
source: If you lose your device and don't have the recovery codes you will lose access to your account.
et: Kui sa kaotad enda seadme koos taastamise koodide siis ei ole võimalust saada enda kasutaja tagasi.

# ManageExternalLogins
source: Manage your external logins
et: Halda väliseid sisselogimisi

source: Manage your account
et: Kasutaja haldamine

# MustGenerateRecoveryCode
source: You must generate a new set of recovery codes before you can log in with a recovery code
et: Sa peaksid genereerima uued taastamise võtmed ennem kui oleks võimalik sisse logida neid kasutades.

source: New password
et: Uus parool

# NoAccessToAuthDevice
source: Don't have access to your authenticator device? You can log in with a recovery code
et: Pole ligipääsu autentimise seadmele? Sisse saab logida ka taastamise koodiga

# NoAccesToResource
source: You do not have access to this resource.
et: Sul ei ole ligipääsu sellele vahendile

# NoLocalAccount
source: You do not have a local username/password for this site. Add a local account so you can log in without an external login.
et: Kui sul ei ole lokaalset kasutajat/parooli selle lehekülje jaoks lisa lokaalne kasutaja nii et oleks võimalik sisse logida ilma välist teenust kasutades.

# NoRecoveryCode
source: You have no recovery codes left.
et: Sul ei ole enam ühtegi taastamise võtit alles.

source: Old password
et: Vana parool

# OneRecoveryCodeLeft
source: Your have 1 recovery code left.
et: Sul on 1 taastamise võti alles.

source: or
et: või

source: Password
et: Parool

source: Password has been reset.
et: Parool on lähtestatud.

source: Personal Data
et: Personaalsed andmed

# PersonalDataInfo
source: Your account contains personal data that you have given us. This page allows you to download or delete that data.
et: Sinu kasutaja sisaldab personaalseid andmeid, mida sa oled meile andnud. See leht võimaldab laadid need andmed alla või kustutada need.

source: Phonenumber
et: Telefoninumber

source: Profile
et: Profiil

source: Recovery code
et: Taastamise võti

source: Recovery codes
et: Taastamise võtmed

# RememberMachine
source: Remember this machine?
et: Pea see seade meeles?

# RemoveThisLogin
source: Remove this {0} login from your account
et: Eemalda see {0} sisselogimine enda kasutajalt

# RequestLoginRecoveryCode
source: You have requested to log in with a recovery code. This login will not be remembered until you provide an authenticator app code at log in or disable 2FA and log in again.
et: Oled esitanud soovi sisse logida kasutades taastamise võtit. See sisselogimise viis ei pea sind meeles kuni sa ei varusta autenitimise rakenduse koodiga sisse logimise ajal või blokeerid 2FA ja logid sisse järjekordselt.

# ResetAuthKey
source: Reset authenticator key
et: Lähtesta autentimise võti

source: Reset password
et: Lähtesta parool

source: Reset recovery codes.
et: Lähtesta taastamise võtmed.

# ScanQRCode
source: Scan the QR Code or enter this key into your two factor authenticator app. Spaces and casing do not matter.
et: Skaneerige QR kood või sisestage see kood enda 2FA rakendusse. Tühikud ja suured/väiksed tähed ei ole olulised.

source: Send verification email
et: Saada verifitseerimise email

source: Set password
et: Seadista parool

source: Shared key
et: Jagatud võti

# ShouldGenerateRecoveryCode
source: You should generate a new set of recovery codes before you can log in with a recovery code
et: Sa peaksid genereerima uued taastamise võtmed ennem kui oleks võimalik sisse logida neid kasutades.

source: Status message
et: Staatuse teade

# SuccessfullyAuthenticated
source: You've successfully authenticated with
et: Oled edukalt autentinud ennast kasutades

# ThankConfirmEmail
source: Thank you for confirming your email
et: Aitäh, et kinnitasite emaili

# ThisActionOnlyDisabled2FA
source: This action only disables 2FA.
et: See tegevus ainult blokeerib 2FA

# ToEnableQRCode
source: To enable QR code generation please read our documentation
et: QR koodi genereerimiseks palun loe meie dokumentatsiooni

# ToUseAuthApp
source: To use an authenticator app go through the following steps
et: Autentimise rakenduse kasutamiseks tehkse järgmised sammud

source: Two-factor authentication
et: Kahe faktoriline autentimine

# TwoFactorCode
source: Authentication code
et: Autentimise kood

source: Update password
et: Uuenda parool

source: Username
et: Kasutajanimi
